In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('Sales.csv')
df

,Order ID,Date,Customer Name,Product Name,Category,Quantity,Price,Total Sales,Gender
0,100001,01-01-2024,Customer_13,T-Shirt,Fashion,5,1200,6000,Female
1,100002,01-01-2024,Customer_139,Microwave,Home Appliances,4,12000,48000,Male
2,100003,01-01-2024,Customer_228,Mobile,Electronics,2,15000,30000,Male
3,100004,01-01-2024,Customer_295,Shoes,Fashion,3,3000,9000,Male
4,100005,01-01-2024,Customer_29,Shoes,Fashion,1,3000,3000,Male
...,...,...,...,...,...,...,...,...,...
1995,101996,29-06-2024,Customer_321,Mixer Grinder,Home Appliances,2,4500,9000,Female
1996,101997,29-06-2024,Customer_171,Jeans,Fashion,2,2500,5000,Male
1997,101998,29-06-2024,Customer_16,Mixer Grinder,Home Appliances,5,4500,22500,Female
1998,101999,29-06-2024,Customer_14,Laptop,Electronics,4,55000,220000,Male
1999,102000,29-06-2024,Customer_313,Book,Stationery,4,500,2000,Male

In [4]:
df.head()

,Order ID,Date,Customer Name,Product Name,Category,Quantity,Price,Total Sales,Gender
0,100001,01-01-2024,Customer_13,T-Shirt,Fashion,5,1200,6000,Female
1,100002,01-01-2024,Customer_139,Microwave,Home Appliances,4,12000,48000,Male
2,100003,01-01-2024,Customer_228,Mobile,Electronics,2,15000,30000,Male
3,100004,01-01-2024,Customer_295,Shoes,Fashion,3,3000,9000,Male
4,100005,01-01-2024,Customer_29,Shoes,Fashion,1,3000,3000,Male

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       2000 non-null   int64
 1   Date           2000 non-null   object
 2   Customer Name  2000 non-null   object
 3   Product Name   2000 non-null   object
 4   Category       2000 non-null   object
 5   Quantity       2000 non-null   int64
 6   Price          2000 non-null   int64
 7   Total Sales    2000 non-null   int64
 8   Gender         2000 non-null   object
dtypes: int64(4), object(5)
memory usage: 140.8+ KB

In [6]:
df['Date'] = pd.to_datetime(df['Date'], format = 'mixed', dayfirst = True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order ID       2000 non-null   int64
 1   Date           2000 non-null   datetime64[ns]
 2   Customer Name  2000 non-null   object
 3   Product Name   2000 non-null   object
 4   Category       2000 non-null   object
 5   Quantity       2000 non-null   int64
 6   Price          2000 non-null   int64
 7   Total Sales    2000 non-null   int64
 8   Gender         2000 non-null   object
dtypes: datetime64[ns](1), int64(4), object(4)
memory usage: 140.8+ KB

In [8]:
reference_date = df['Date'].max()
reference_date

Timestamp('2024-06-29 00:00:00')

In [9]:
recency_df = df.groupby('Customer Name')['Date'].max().reset_index()
recency_df['recency'] = (reference_date - recency_df['Date']).dt.days 
recency_df.head()

  Customer Name       Date  recency
0    Customer_1 2024-04-25       65
1   Customer_10 2024-06-27        2
2  Customer_101 2024-06-22        7
3  Customer_102 2024-06-27        2
4  Customer_103 2024-05-25       35

In [10]:
frequency_df = df.groupby('Customer Name').size().reset_index(name = 'Frequency')
frequency_df

    Customer Name  Frequency
0      Customer_1          5
1     Customer_10          6
2    Customer_101          5
3    Customer_102         11
4    Customer_103          4
..            ...        ...
342   Customer_95          3
343   Customer_96          9
344   Customer_97          6
345   Customer_98          5
346   Customer_99          7

[347 rows x 2 columns]

In [20]:
monetary_df = df.groupby('Customer Name')['Total Sales'].sum().reset_index(name= 'Monetary')
monetary_df

    Customer Name  Monetary
0      Customer_1    140500
1     Customer_10     51700
2    Customer_101    324000
3    Customer_102    515500
4    Customer_103     64500
..            ...       ...
342   Customer_95     13000
343   Customer_96    215900
344   Customer_97    143500
345   Customer_98     79900
346   Customer_99    515500

[347 rows x 2 columns]

In [21]:
rf_df = recency_df.merge(frequency_df, on ='Customer Name')
rf_df

    Customer Name       Date  recency  Frequency
0      Customer_1 2024-04-25       65          5
1     Customer_10 2024-06-27        2          6
2    Customer_101 2024-06-22        7          5
3    Customer_102 2024-06-27        2         11
4    Customer_103 2024-05-25       35          4
..            ...        ...      ...        ...
342   Customer_95 2024-05-16       44          3
343   Customer_96 2024-06-27        2          9
344   Customer_97 2024-06-01       28          6
345   Customer_98 2024-06-21        8          5
346   Customer_99 2024-06-29        0          7

[347 rows x 4 columns]

In [22]:
rfm = rf_df.merge(monetary_df, on = 'Customer Name')
rfm

    Customer Name       Date  recency  Frequency  Monetary
0      Customer_1 2024-04-25       65          5    140500
1     Customer_10 2024-06-27        2          6     51700
2    Customer_101 2024-06-22        7          5    324000
3    Customer_102 2024-06-27        2         11    515500
4    Customer_103 2024-05-25       35          4     64500
..            ...        ...      ...        ...       ...
342   Customer_95 2024-05-16       44          3     13000
343   Customer_96 2024-06-27        2          9    215900
344   Customer_97 2024-06-01       28          6    143500
345   Customer_98 2024-06-21        8          5     79900
346   Customer_99 2024-06-29        0          7    515500

[347 rows x 5 columns]

In [23]:
def segment_customer(row):
    if row['recency'] <= 30 and row['Frequency'] >= 5 and row['Monetary'] >= 50000:
        return 'Champion'
    elif row['Frequency'] >= 3 and row['Monetary'] >= 20000:
        return 'Loyal'
    else:
        return 'Hibernating'

rfm['Segment'] = rfm.apply(segment_customer, axis=1)

In [24]:
rfm

    Customer Name       Date  recency  Frequency  Monetary      Segment
0      Customer_1 2024-04-25       65          5    140500        Loyal
1     Customer_10 2024-06-27        2          6     51700     Champion
2    Customer_101 2024-06-22        7          5    324000     Champion
3    Customer_102 2024-06-27        2         11    515500     Champion
4    Customer_103 2024-05-25       35          4     64500        Loyal
..            ...        ...      ...        ...       ...          ...
342   Customer_95 2024-05-16       44          3     13000  Hibernating
343   Customer_96 2024-06-27        2          9    215900     Champion
344   Customer_97 2024-06-01       28          6    143500     Champion
345   Customer_98 2024-06-21        8          5     79900     Champion
346   Customer_99 2024-06-29        0          7    515500     Champion

[347 rows x 6 columns]

In [16]:
rfm.to_csv('rfm_customer360.csv',index=False)

In [17]:
rfm['Segment'].value_counts()

Segment
Champion       176
Loyal          140
Hibernating     31
Name: count, dtype: int64

In [18]:
rfm.groupby('Segment')['Monetary'].mean()

Segment
Champion       246640.909091
Hibernating     59445.161290
Loyal          163480.000000
Name: Monetary, dtype: float64

In [25]:
rfm.head()

  Customer Name       Date  recency  Frequency  Monetary   Segment
0    Customer_1 2024-04-25       65          5    140500     Loyal
1   Customer_10 2024-06-27        2          6     51700  Champion
2  Customer_101 2024-06-22        7          5    324000  Champion
3  Customer_102 2024-06-27        2         11    515500  Champion
4  Customer_103 2024-05-25       35          4     64500     Loyal